### this is taken from medium,  https://towardsdatascience.com/introduction-to-data-preprocessing-in-machine-learning-a9fa83a5dc9d

In [1]:
#imprt the needed lib
import numpy as np
import pandas as pd

In [3]:
# create a dummy dataframe
data = [['steve',25,55],['linus',28,60],['elon',26]]

df = pd.DataFrame(data=data, columns=['Name','Age','Weight'])

In [4]:
df

    Name  Age  Weight
0  steve   25    55.0
1  linus   28    60.0
2   elon   26     NaN

In [5]:
# check if any null
df.isnull()

    Name    Age  Weight
0  False  False   False
1  False  False   False
2  False  False    True

In [6]:
# check how many null 
df.isnull().sum()

Name      0
Age       0
Weight    1
dtype: int64

In [7]:
# drop row having null
df.dropna()

    Name  Age  Weight
0  steve   25    55.0
1  linus   28    60.0

In [8]:
# Our original dataframe still has the 3rd row intact as we did not set inplace=True in the above operation
df

    Name  Age  Weight
0  steve   25    55.0
1  linus   28    60.0
2   elon   26     NaN

### imputation
using simpleimputer class for imputation

In [11]:
from sklearn.impute import SimpleImputer

ModuleNotFoundError: No module named 'sklearn.impute'